export default {
  projections: {
    СпрСтудE: {
      фио: {
        __caption__: 'Фио студента'
      },
      спрГруппа: {
        __caption__: 'Группа',
        назв: {
          __caption__: 'Группа'
        }
      },
      спрДисциплина: {
        __caption__: 'Дисциплина',
        наименование: {
          __caption__: 'Дисциплина'
        }
      }
    },
    СпрСтудL: {
      фио: {
        __caption__: 'Фио студента'
      }
    }
  },
  validations: {
    фио: {
      __caption__: 'Фио студента'
    },
    спрГруппа: {
      __caption__: 'Группа'
    },
    спрДисциплина: {
      __caption__: 'Дисциплина'
    }
  }
};
