export default {
  projections: {
    СтатE: {
      спрПрепод: {
        __caption__: 'Фио преподавателя',
        фио: {
          __caption__: 'Фио преподавателя'
        },
        спрДолжность: {
          __caption__: '',
          наименование: {
            __caption__: 'Должность'
          }
        },
        спрДисциплина: {
          __caption__: '',
          наименование: {
            __caption__: 'Дисциплина'
          }
        },
        спрГруппа: {
          __caption__: '',
          назв: {
            __caption__: 'Группа'
          }
        }
      },
      контр: {
        __caption__: 'Функция: Контроль просмотра и прикрепления студентов',
        спрСтуд: {
          __caption__: 'Фио студента',
          фио: {
            __caption__: 'Фио студента'
          },
          спрГруппа: {
            __caption__: '',
            назв: {
              __caption__: 'Группа'
            }
          },
          спрДисциплина: {
            __caption__: '',
            наименование: {
              __caption__: 'Дисциплина'
            }
          }
        },
        статус: {
          __caption__: 'Статус прикрепления'
        },
        просмотр: {
          __caption__: 'Статус просмотра'
        }
      }
    },
    СтатL: {
      спрПрепод: {
        __caption__: 'Фио преподавателя',
        фио: {
          __caption__: 'Фио преподавателя'
        },
        спрДолжность: {
          __caption__: '',
          наименование: {
            __caption__: 'Должность'
          }
        },
        спрДисциплина: {
          __caption__: '',
          наименование: {
            __caption__: 'Дисциплина'
          }
        },
        спрГруппа: {
          __caption__: '',
          назв: {
            __caption__: 'Группа'
          }
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'дата'
    },
    спрПрепод: {
      __caption__: 'Фио преподавателя'
    },
    спрСтуд: {
      __caption__: 'спрСтуд'
    },
    контр: {
      __caption__: 'Функция: Контроль просмотра и прикрепления студентов'
    }
  }
};
