export default {
  projections: {
    ПросмотрE: {
      спрСтуд: {
        __caption__: 'Фио студента',
        фио: {
          __caption__: 'Фио студента'
        },
        спрГруппа: {
          __caption__: '',
          назв: {
            __caption__: 'Группа'
          }
        }
      },
      метМат: {
        __caption__: 'Просмотр прикрепленных книг студентом',
        спрМатериалы: {
          __caption__: 'Материал',
          наименование: {
            __caption__: 'Материал'
          },
          вид: {
            __caption__: 'Вид материала'
          },
          спрДисциплина: {
            __caption__: '',
            наименование: {
              __caption__: 'Дисциплина'
            }
          }
        }
      }
    },
    ПросмотрL: {
      спрСтуд: {
        __caption__: 'Фио студента',
        фио: {
          __caption__: 'Фио студента'
        },
        спрГруппа: {
          __caption__: '',
          назв: {
            __caption__: 'Группа'
          }
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'дата'
    },
    спрСтуд: {
      __caption__: 'Фио студента'
    },
    метМат: {
      __caption__: 'Просмотр прикрепленных книг студентом'
    }
  }
};
