export default {
  projections: {
    ПросмотрE: {
      спрСтуд: {
        __caption__: 'Фио студента',
        фио: {
          __caption__: 'Фио студента'
        },
        спрГруппа: {
          __caption__: '',
          назв: {
            __caption__: 'Группа'
          }
        }
      }
    },
    ПросмотрL: {
      спрСтуд: {
        __caption__: 'Фио студента',
        фио: {
          __caption__: 'Фио студента'
        },
        спрГруппа: {
          __caption__: '',
          назв: {
            __caption__: 'Группа'
          }
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'дата'
    },
    спрСтуд: {
      __caption__: 'Фио студента'
    }
  }
};
