export default {
  projections: {
    СпрМатериалыE: {
      наименование: {
        __caption__: 'Название материала'
      },
      вид: {
        __caption__: 'Вид материала'
      },
      спрДисциплина: {
        __caption__: 'Дисциплина',
        наименование: {
          __caption__: 'Дисциплина'
        }
      }
    },
    СпрМатериалыL: {
      наименование: {
        __caption__: 'Название материала'
      },
      вид: {
        __caption__: 'Вид материала'
      },
      спрДисциплина: {
        __caption__: 'Дисциплина',
        наименование: {
          __caption__: 'Дисциплина'
        }
      }
    }
  },
  validations: {
    вид: {
      __caption__: 'Вид материала'
    },
    наименование: {
      __caption__: 'Название материала'
    },
    спрДисциплина: {
      __caption__: 'Дисциплина'
    }
  }
};
