export default {
  projections: {
    КонтрE: {
      спрСтуд: {
        __caption__: 'Фио студента',
        фио: {
          __caption__: 'Фио студента'
        },
        спрГруппа: {
          __caption__: '',
          назв: {
            __caption__: 'Группа'
          }
        },
        спрДисциплина: {
          __caption__: '',
          наименование: {
            __caption__: 'Дисциплина'
          }
        }
      },
      статус: {
        __caption__: 'Статус прикрепления'
      },
      просмотр: {
        __caption__: 'Статус просмотра'
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'дата'
    },
    просмотр: {
      __caption__: 'Статус просмотра'
    },
    статус: {
      __caption__: 'Статус прикрепления'
    },
    спрСтуд: {
      __caption__: 'Фио студента'
    },
    стат: {
      __caption__: 'стат'
    }
  }
};
