export default {
  projections: {
    ПрикрепКнE: {
      спрПрепод: {
        __caption__: 'Фио Преподавателя',
        фио: {
          __caption__: 'Фио Преподавателя'
        },
        спрДолжность: {
          __caption__: '',
          наименование: {
            __caption__: 'Должность'
          }
        },
        спрДисциплина: {
          __caption__: '',
          наименование: {
            __caption__: 'Дисциплина'
          }
        },
        спрГруппа: {
          __caption__: '',
          назв: {
            __caption__: 'Группа'
          }
        }
      }
    },
    ПрикрепКнL: {
      спрПрепод: {
        __caption__: 'Фио преподавателя',
        фио: {
          __caption__: 'Фио преподавателя'
        },
        спрДолжность: {
          __caption__: '',
          наименование: {
            __caption__: 'Дожность'
          }
        },
        спрДисциплина: {
          __caption__: '',
          наименование: {
            __caption__: 'Дисциплина'
          }
        },
        спрГруппа: {
          __caption__: '',
          назв: {
            __caption__: 'Группа'
          }
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'дата'
    },
    спрПрепод: {
      __caption__: 'Фио Преподавателя'
    }
  }
};
