export default {
  projections: {
    ПрикрепКнE: {
      спрПрепод: {
        __caption__: 'Фио Преподавателя',
        фио: {
          __caption__: 'Фио Преподавателя'
        },
        спрДолжность: {
          __caption__: '',
          наименование: {
            __caption__: 'Должность'
          }
        },
        спрДисциплина: {
          __caption__: '',
          наименование: {
            __caption__: 'Дисциплина'
          }
        },
        спрГруппа: {
          __caption__: '',
          назв: {
            __caption__: 'Группа'
          }
        }
      },
      базДан: {
        __caption__: 'База студентов с прикрепленными книгами',
        спрСтуд: {
          __caption__: 'Фио студента',
          фио: {
            __caption__: 'Фио студента'
          },
          спрГруппа: {
            __caption__: '',
            назв: {
              __caption__: 'Группа'
            }
          },
          спрДисциплина: {
            __caption__: '',
            наименование: {
              __caption__: 'Дисиплина'
            }
          }
        },
        спрМатериалы: {
          __caption__: 'Название материала',
          наименование: {
            __caption__: 'Название материала'
          },
          вид: {
            __caption__: 'Вид материала'
          }
        }
      }
    },
    ПрикрепКнL: {
      спрПрепод: {
        __caption__: 'Фио преподавателя',
        фио: {
          __caption__: 'Фио преподавателя'
        },
        спрДолжность: {
          __caption__: '',
          наименование: {
            __caption__: 'Дожность'
          }
        },
        спрДисциплина: {
          __caption__: '',
          наименование: {
            __caption__: 'Дисциплина'
          }
        },
        спрГруппа: {
          __caption__: '',
          назв: {
            __caption__: 'Группа'
          }
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'дата'
    },
    спрПрепод: {
      __caption__: 'Фио Преподавателя'
    },
    базДан: {
      __caption__: 'База студентов с прикрепленными книгами'
    }
  }
};
