export default {
  projections: {
    МетМатE: {
      спрМатериалы: {
        __caption__: 'Материал',
        наименование: {
          __caption__: 'Материал'
        },
        вид: {
          __caption__: 'Вид материала'
        },
        спрДисциплина: {
          __caption__: '',
          наименование: {
            __caption__: 'Дисциплина'
          }
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'дата'
    },
    спрМатериалы: {
      __caption__: 'Материал'
    },
    просмотр: {
      __caption__: 'просмотр'
    }
  }
};
