export default {
  projections: {
    СпрПреподE: {
      фио: {
        __caption__: 'Фио преподавателя'
      },
      спрДолжность: {
        __caption__: 'Должность',
        наименование: {
          __caption__: 'Должность'
        }
      },
      спрГруппа: {
        __caption__: 'Группа',
        назв: {
          __caption__: 'Группа'
        }
      },
      спрДисциплина: {
        __caption__: 'Дисциплина',
        наименование: {
          __caption__: 'Дисциплина'
        }
      }
    },
    СпрПреподL: {
      фио: {
        __caption__: 'Фио преподавателя'
      },
      спрДолжность: {
        __caption__: 'Должность',
        наименование: {
          __caption__: 'Должность'
        }
      },
      спрГруппа: {
        __caption__: 'Группа',
        назв: {
          __caption__: 'Группа'
        }
      },
      спрДисциплина: {
        __caption__: 'Дисциплина',
        наименование: {
          __caption__: 'Дисциплина'
        }
      }
    }
  },
  validations: {
    фио: {
      __caption__: 'Фио преподавателя'
    },
    спрГруппа: {
      __caption__: 'Группа'
    },
    спрДисциплина: {
      __caption__: 'Дисциплина'
    },
    спрДолжность: {
      __caption__: 'Должность'
    }
  }
};
